# -*- coding: utf-8 -*-
def show_info():
    print('============================================================================================================================')
    print('由于本程序仅用于测试，未使用任何需要付费的反爬措施，为避免触发滑动验证甚至封号，程序运行时间较长！')
    print('经过测试发现淘宝评论的反爬机制是滑动验证，同一ip短时间内多次访问相同url很容易触发滑动验证。')
    print('本程序正常运行中没有反复请求同一url的情况，使用随机延时来避免滑动验证的触发，每次请求间隔1-5秒不等。')
    print('由于本程序仅为简单测试数据获取，并未进行去重处理，也并未将数据进行持久化。')
    print('如需通过去重实现断点续爬及数据持久化，后续可结合数据库进行开发，如：scrapy-redis或MySQL或MongoDB或Redis+MySQL或Redis+MongoDB')
    print('程序中的我自己的cookie已经删掉，如需运行程序请先设置自己的cookie')
    print('============================================================================================================================')
    print('功能：')
    print('1、搜索商品\n2、显示当前设置\n3、设置Cookie\n4、修改搜索商品API\n5、修改获取评论API\n6、设置爬取页数\n7、配置初始化')
    print('注：初始商品爬取页数为100，评论爬取页数默认为8')
